print('Задача 7. Великий и могучий')

# Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку.
# Особенно Паоло понравилась книга “Преступление и наказание”.
# И ему стало интересно,
# какое можно найти самое длинное слово в этой книге, чтобы потом сравнить его с аналогом на своём языке.
# 
# Напишите программу,
# которая получает на вход текст и находит длину самого длинного слова в нём.
# Слова в тексте разделяются одним пробелом.
# 
# Пример:
# Введите текст: Меня зовут Петр
# Длина самого длинного слова: 5

text = input("Введите текст: ")

s_count = 0
longest = 0

for sym in text:
    if sym == ' ':
        if s_count > longest:
            longest = s_count
        s_count = 0
    else:
        s_count += 1
        if s_count > longest:
            longest = s_count

print(longest)
